ErpTest/src/AccumulationRegisters/ТоварыКОформлениюОтчетовКомитенту/ТоварыКОформлениюОтчетовКомитенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОформлениюОтчетовКомитенту</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыручки</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоСписано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоКОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыручкиКОформлению</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоСписаноКОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВознаграждения</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСчетаФактуры</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетаФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/ПрочиеАктивыПассивы/ПрочиеАктивыПассивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПрочиеАктивыПассивы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсточника</name>
    <type>
      <types>EnumRef.ВидыИсточниковУправленческогоБаланса</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>EnumRef.ИсточникиУправленческогоБаланса</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДвижений</name>
    <type>
      <types>EnumRef.ИсточникиДвижений</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Enums/ТипыЗапасов/ТипыЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗапасов</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйТовар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>МатериалДавальца</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияДавальца</name>
  </enumValues>
  <enumValues>
    <name>АгентскаяУслуга</name>
  </enumValues>
  <enumValues>
    <name>ТоварНаХраненииСПравомПродажи</name>
    <comment>Товар, принятый на ответственное хранение с целью дальнейшей продажи</comment>
  </enumValues>
  <enumValues>
    <name>СобственныйТоварВПути</name>
  </enumValues>
  <enumValues>
    <name>СобственныйТоварПоНеотфактурованнойПоставке</name>
  </enumValues>
  <enumValues>
    <name>ТоварТребующийПодтвержденияВыпуска</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/СписаниеНедостачТоваров/СписаниеНедостачТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеНедостачТоваров</name>
  <basedOn>Document.ОрдерНаОтражениеНедостачТоваров</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюОтчетовКомитенту</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНМатериалы</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНТовары</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизацийКПередаче</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ПартииЗатратНаВыпуск</registerRecords>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <type>
      <types>EnumRef.ИсточникиИнформацииОЦенахДляПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыЗапасовУказаныВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчетТоваров</name>
    <type>
      <types>DocumentRef.ПересчетТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЕстьАлкогольнаяПродукцияДляСписанияЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/AccumulationRegisters/ТоварыКОформлениюОтчетовКомитенту/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ВидЗапасов.Организация)
	|	И ЗначениеРазрешено(ВидЗапасов.ВладелецТовара)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Обработчик обновления УТ 11.4.1
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту";
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор,
	|	ДД.ВидДвижения,
	|	ДД.ВидЗапасов,
	|	АналитикаВладельца.Ссылка КАК АналитикаУчетаНоменклатуры,
	|	ДД.Валюта,
	|	ДД.НомерГТД,
	|	СпрВидыЗапасов.ВидЗапасовВладельца КАК ВидЗапасовВладельца
	|ПОМЕСТИТЬ ДвиженияИнтеркампани
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту КАК ДД
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|	ПО ДД.АналитикаУчетаНоменклатуры = Ключи.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|	ПО ДД.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаВладельца
	|	ПО АналитикаВладельца.Номенклатура = Ключи.Номенклатура
	|		И АналитикаВладельца.Характеристика = Ключи.Характеристика
	|		И АналитикаВладельца.Серия = Ключи.Серия
	|		И АналитикаВладельца.Склад = СпрВидыЗапасов.ВидЗапасовВладельца.ВладелецТовара
	|		И АналитикаВладельца.СтатьяКалькуляции = Ключи.СтатьяКалькуляции
	|ГДЕ 
	|	ДД.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|	И ДД.ВидЗапасов.ВидЗапасовВладельца.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|;
	|//////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОбработке.Регистратор КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКОформлению.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту КАК ТоварыКОформлению
	|	ГДЕ
	|		ТоварыКОформлению.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		И ТоварыКОформлению.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|		И ТИПЗНАЧЕНИЯ(ТоварыКОформлению.Регистратор) <> ЗНАЧЕНИЕ(Документ.КорректировкаРегистров)
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыКОформлению.Регистратор
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТоварыКОформлению.Регистратор
	|	ИЗ
	|		РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту КАК ТоварыКОформлению
	|	ГДЕ
	|		ТИПЗНАЧЕНИЯ(ТоварыКОформлению.Регистратор) <> ЗНАЧЕНИЕ(Документ.КорректировкаРегистров)
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыКОформлению.Регистратор
	|	ИМЕЮЩИЕ
	|		(СУММА(ТоварыКОформлению.КоличествоКОформлению) <> СУММА(ТоварыКОформлению.Количество)
	|			ИЛИ СУММА(ТоварыКОформлению.СуммаВыручкиКОформлению) <> СУММА(ТоварыКОформлению.СуммаВыручки)
	|			ИЛИ СУММА(ТоварыКОформлению.КоличествоСписаноКОформлению) <> СУММА(ТоварыКОформлению.КоличествоСписано))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДД.Регистратор
	|	ИЗ
	|		ДвиженияИнтеркампани КАК ДД
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту КАК ДвиженияПоКомитенту
	|		ПО ДвиженияПоКомитенту.Регистратор = ДД.Регистратор
	|			И ДвиженияПоКомитенту.ВидДвижения = ДД.ВидДвижения
	|			И ДвиженияПоКомитенту.ВидЗапасов = ДД.ВидЗапасовВладельца
	|			И ДвиженияПоКомитенту.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
	|			И ДвиженияПоКомитенту.Валюта = ДД.Валюта
	|			И ДвиженияПоКомитенту.НомерГТД = ДД.НомерГТД
	|	ГДЕ
	|		ТИПЗНАЧЕНИЯ(ДД.Регистратор) <> ЗНАЧЕНИЕ(Документ.ОтчетПоКомиссииМеждуОрганизациями)
	|		И ТИПЗНАЧЕНИЯ(ДД.Регистратор) <> ЗНАЧЕНИЕ(Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании)
	|		И ТИПЗНАЧЕНИЯ(ДД.Регистратор) <> ЗНАЧЕНИЕ(Документ.КорректировкаРегистров)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДД.Регистратор
	|	ИЗ
	|		ДвиженияИнтеркампани КАК ДД
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту КАК ДвиженияПоКомитенту
	|		ПО ДвиженияПоКомитенту.Регистратор = ДД.Регистратор
	|			И ДвиженияПоКомитенту.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И ДвиженияПоКомитенту.ВидЗапасов = ДД.ВидЗапасовВладельца
	|			И ДвиженияПоКомитенту.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
	|			И ДвиженияПоКомитенту.Валюта = ДД.Валюта
	|			И ДвиженияПоКомитенту.НомерГТД = ДД.НомерГТД
	|	ГДЕ
	|		(ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ЗНАЧЕНИЕ(Документ.ОтчетПоКомиссииМеждуОрганизациями)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ЗНАЧЕНИЕ(Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании))
	|		И ДвиженияПоКомитенту.Регистратор ЕСТЬ NULL
	|
	|	) КАК КОбработке
	|");
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Регистраторы, ДополнительныеПараметры);
	РегистрыНакопления.ПрочиеАктивыПассивы.ЗарегистироватьКОбновлениюУправленческогоБаланса(Параметры, Регистраторы, ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.ВнутреннееПотреблениеТоваров");
	Регистраторы.Добавить("Документ.ВозвратТоваровМеждуОрганизациями");
	Регистраторы.Добавить("Документ.ВозвратТоваровОтКлиента");
	Регистраторы.Добавить("Документ.КорректировкаРеализации");
	Регистраторы.Добавить("Документ.ОтчетКомиссионера");
	Регистраторы.Добавить("Документ.ОтчетКомиссионераОСписании");
	Регистраторы.Добавить("Документ.ОтчетКомитенту");
	Регистраторы.Добавить("Документ.ОтчетКомитентуОСписании");
	Регистраторы.Добавить("Документ.ОтчетОРозничныхПродажах");
	Регистраторы.Добавить("Документ.ОтчетПоКомиссииМеждуОрганизациями");
	Регистраторы.Добавить("Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании");
	Регистраторы.Добавить("Документ.ПередачаТоваровМеждуОрганизациями");
	Регистраторы.Добавить("Документ.ПересортицаТоваров");
	Регистраторы.Добавить("Документ.ПорчаТоваров");
	Регистраторы.Добавить("Документ.ПрочееОприходованиеТоваров");
	Регистраторы.Добавить("Документ.РеализацияТоваровУслуг");
	Регистраторы.Добавить("Документ.СборкаТоваров");
	Регистраторы.Добавить("Документ.СписаниеНедостачТоваров");
	
	// ++ НЕ УТ
	Регистраторы.Добавить("Документ.ПередачаСырьяПереработчику");
	Регистраторы.Добавить("Документ.ПередачаМатериаловВПроизводство");
	Регистраторы.Добавить("Документ.РаспределениеПроизводственныхЗатрат");
	Регистраторы.Добавить("Документ.ДвижениеПродукцииИМатериалов");
	Регистраторы.Добавить("Документ.ПроизводствоБезЗаказа");
	// -- НЕ УТ
	
	// ++ НЕ УТКА
	Регистраторы.Добавить("Документ.ВозвратСырьяОтПереработчика");
	// -- НЕ УТКА
	
	ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(Регистраторы, "РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту", Параметры.Очередь);
	
	ОбработкаЭтапаЗавершена = Истина;
	// ++ НЕ УТКА
	
	ПолноеИмяРегистра = "РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту";
	МетаданныеРегистра = Метаданные.РегистрыНакопления.ТоварыКОформлениюОтчетовКомитенту;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьРегистраторыРегистраДляОбработки(Параметры.Очередь, "Документ.ЭтапПроизводства2_2", ПолноеИмяРегистра);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Товары.Период             КАК Период,
	|	Товары.ВидДвижения        КАК ВидДвижения,
	|	Товары.ВидЗапасов                 КАК ВидЗапасов,
	|	Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Товары.Валюта                     КАК Валюта,
	|	Товары.НомерГТД                   КАК НомерГТД,
	|	Товары.Количество                 КАК Количество,
	|	Товары.СуммаВыручки               КАК СуммаВыручки,
	|	Товары.КоличествоСписано          КАК КоличествоСписано,
	|	Товары.КоличествоКОформлению      КАК КоличествоКОформлению,
	|	Товары.СуммаВыручкиКОформлению    КАК СуммаВыручкиКОформлению,
	|	ВЫБОР КОГДА Товары.КоличествоСписаноКОформлению = 0
	|		ТОГДА Товары.КоличествоСписано
	|		ИНАЧЕ Товары.КоличествоСписаноКОформлению
	|	КОНЕЦ                             КАК КоличествоСписаноКОформлению,
	|	Товары.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Товары.СуммаВознаграждения        КАК СуммаВознаграждения,
	|	Товары.ДокументРеализации         КАК ДокументРеализации,
	|	Товары.ДатаСчетаФактуры           КАК ДатаСчетаФактуры,
	|	Товары.Покупатель                 КАК Покупатель,
	|	ВЫБОР КОГДА Товары.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		И Товары.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		ИНАЧЕ Товары.КорВидЗапасов
	|	КОНЕЦ                             КАК КорВидЗапасов,
	|	Товары.Номенклатура               КАК Номенклатура,
	|	Товары.Характеристика             КАК Характеристика,
	|	Товары.НомерСчетаФактуры             КАК НомерСчетаФактуры,
	|	Товары.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	Товары.НалогообложениеНДС            КАК НалогообложениеНДС
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту КАК Товары
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Товары.Регистратор) = ТИП(Документ.ЭтапПроизводства2_2)
	|	И Товары.Регистратор = &Регистратор
	|";
	
	Пока Выборка.Следующий() Цикл
		
		Регистратор = Выборка.Регистратор;
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", Регистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

			Блокировка.Заблокировать();
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Регистратор", Регистратор);
			
			Набор = РегистрыНакопления.ТоварыКОформлениюОтчетовКомитенту.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Регистратор);
			
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() = 0 Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Набор);
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			Набор.Загрузить(Результат);
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обработать документ: %Регистратор% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Регистратор%", Регистратор);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				Регистратор.Метаданные(), ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
	ОбработкаЭтапаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	// -- НЕ УТКА
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена И ОбработкаЭтапаЗавершена;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
